In [2]:
import pandas as pd
import numpy as np

df = pd.read_csv('train.csv')

In [3]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
dicionario = {
    'COLUNA_A': [1, 2, 3, 4, 5],
    'COLUNA_B': ['a', 'b', 'c', 'd', 'e'],
    'COLUNA_C': [100, 200, 300, 400, 500]
}

In [5]:
df = pd.DataFrame(dicionario)
df

   COLUNA_A COLUNA_B  COLUNA_C
0         1        a       100
1         2        b       200
2         3        c       300
3         4        d       400
4         5        e       500

In [6]:
produtos = pd.Series(['Celular', 'Tablet', 'Notebook', 'Fone de Ouvido', 'Smartwatch'])
quantidade_estoque = pd.Series([15, 8, 20, 5, 12])

dicionario = {
    'nome': ['Celular', 'Tablet', 'Notebook', 'Fone de Ouvido', 'Smartwatch'],
    'qtd_estoque': [15, 8, 20, 5, 12]
}

df = pd.DataFrame(dicionario)
df

             nome  qtd_estoque
0         Celular           15
1          Tablet            8
2        Notebook           20
3  Fone de Ouvido            5
4      Smartwatch           12

In [7]:
dados = [
  [1.69, 87.0],
  [1.59, 56.5],
  [1.69, 90.3],
  [1.74, 78.6]
]
df = pd.DataFrame(dados, columns=['altura', 'peso'])
df

   altura  peso
0    1.69  87.0
1    1.59  56.5
2    1.69  90.3
3    1.74  78.6

In [8]:
produtos = pd.Series(['Celular', 'Tablet', 'Notebook', 'Fone de Ouvido', 'Smartwatch'])
quantidade_estoque = pd.Series([15, 8, 20, 5, 12])

dicionario = {
    'nome': ['Celular', 'Tablet', 'Notebook', 'Fone de Ouvido', 'Smartwatch'],
    'qtd_estoque': [15, 8, 20, 5, 12]
}

df = pd.DataFrame(dicionario, index=[214314, 431431, 532453, 542234, 431413])
df

                  nome  qtd_estoque
214314         Celular           15
431431          Tablet            8
532453        Notebook           20
542234  Fone de Ouvido            5
431413      Smartwatch           12

In [9]:
df.shape

(5, 2)

In [10]:
df.index

Index([214314, 431431, 532453, 542234, 431413], dtype='int64')

In [11]:
df.to_csv("produtos.csv", index=False)

In [12]:
dados = [
  [1.69, 87.0],
  [1.59, 56.5],
  [1.69, 90.3],
  [1.74, 78.6]
]
df = pd.DataFrame(dados, columns=['altura', 'peso'], index = ['a', 'b', 'c', 'd'])
df

   altura  peso
a    1.69  87.0
b    1.59  56.5
c    1.69  90.3
d    1.74  78.6

In [13]:
df['peso']

a    87.0
b    56.5
c    90.3
d    78.6
Name: peso, dtype: float64

In [14]:
df[['peso', 'altura']]

   peso  altura
a  87.0    1.69
b  56.5    1.59
c  90.3    1.69
d  78.6    1.74

In [15]:
df.iloc[1]

altura     1.59
peso      56.50
Name: b, dtype: float64

In [16]:
df.iloc[0]

altura     1.69
peso      87.00
Name: a, dtype: float64

In [17]:
df.loc['b']

altura     1.59
peso      56.50
Name: b, dtype: float64

In [18]:
df['peso'][1]

C:\Users\Drac3\AppData\Local\Temp\ipykernel_7516\2551684995.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df['peso'][1]

56.5

In [19]:
df['peso'].loc['b']

56.5

In [21]:
df.iloc[1, 0]

1.59

In [22]:
df.loc['b', 'altura']

1.59